#### Python Journey 
#### @AlfonsoChangM

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('Lending-company.csv', index_col = 'LoanID')

In [3]:
lending_co_data = data.copy()
lending_co_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [4]:
lending_co_data['StartDate'].head()

LoanID
1    04/07/2018
2    02/01/2019
3    08/12/2016
4           NaN
5    28/10/2017
Name: StartDate, dtype: object

In [5]:
lending_co_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1043 entries, 1 to 1043
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   StringID        1043 non-null   object
 1   Product         1043 non-null   object
 2   CustomerGender  1043 non-null   object
 3   Location        1043 non-null   object
 4   Region          1042 non-null   object
 5   TotalPrice      1018 non-null   float64
 6   StartDate       1042 non-null   object
 7   Deposit         1043 non-null   int64
 8   DailyRate       1043 non-null   int64
 9   TotalDaysYr     1043 non-null   int64
 10  AmtPaid36       1043 non-null   int64
 11  AmtPaid60       1043 non-null   int64
 12  AmtPaid360      1043 non-null   int64
 13  LoanStatus      1006 non-null   object
dtypes: float64(1), int64(6), object(7)
memory usage: 122.2+ KB

In [6]:
lending_co_data['StartDate'].dtype

dtype('O')